methods/forainet/configs/for_instance_development.yml
project:
  name: tree-seg-benchmark
  dataset_slug: for-instance
  method_slug: forainet
  protocol_id: for_instance_pointwise_v1
  status: ready_for_full_development_published_checkpoint

dataset:
  slug: for-instance
  version: original
  permitted_split: dev
  expected_plot_count: 21
  forbid_test_paths: true

method:
  slug: forainet
  name: ForAINet
  upstream_commit: 5fe600ae8f2fe913ae8740f475f0261a702f2a72
  training_mode: published_pretrained
  checkpoint_sha256: 97c03ce81621dc4193e55d2ca2294861b1f4421c94d192799e5fe031f9d35861

gates:
  accepted_smoke_required: true
  accepted_smoke_passed: true
  manual_alignment_required: true
  manual_alignment_passed: true
  collision_policy: refuse
  held_out_access: forbidden

execution:
  plot_count: 21
  array_concurrency: 2
  partition: gpu-a-lowsmall
  gpu: a100
  gpus_per_task: 1
  cpus_per_task: 12
  memory_gb: 128
  time_limit_hours: 4
  label_independence_evidence: accepted_development_smoke